RIET/src/InformationRegisters/РасчетАмортизацииОС/РасчетАмортизацииОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетАмортизацииОС</name>
  <resources>
    <name>СуммаБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодАмортизации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/МестонахождениеОСБухгалтерскийУчет/МестонахождениеОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахождениеОСБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МОЛ</name>
    <comment>Выбирается из списка регистра сведений &quot;Работники организаций&quot;</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/AccumulationRegisters/СтоимостьАмортизацияОС/СтоимостьАмортизацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьАмортизацияОС</name>
  <resources>
    <name>СтоимостьБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АмортизацияБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АмортизацияНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/ПервоначальныеСведения/ПервоначальныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПервоначальныеСведения</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПервоначальнаяСтоимостьБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимостьНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияАктивов</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПогашенияСтоимости</name>
    <type>
      <types>EnumRef.ПорядокПогашенияСтоимостиОС</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокВключенияСтоимостиВСоставРасходов</name>
    <type>
      <types>EnumRef.ПорядокВключенияСтоимостиОСВСоставРасходовНУ</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДо2002</name>
    <comment>Первоначальная (вост.) стоимость до 01.01.2002 для НУ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АмортизацияДо2002</name>
    <comment>Сумма амортизационных начислений до 01.01.2002 для НУ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсНаДатуПринятияКУчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КРПервоначальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/НачислениеАмортизации/НачислениеАмортизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НачислениеАмортизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачислятьБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпециальныйКоэффициент</name>
    <comment>Значение специального коэффициента</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокБУ</name>
    <comment>Срок использования для вычисления амортизации, мес.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБУ</name>
    <comment>Стоимость для вычисления амортизации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокНУ</name>
    <comment>Срок полезного использования, мес., НУ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияБУ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВводаНУ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользованияБУ</name>
    <comment>Срок полезного использования, мес. БУ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/CommonModules/Привилегированный/Module.bsl
Процедура ПереместитьОС(ОС, Сдатчик, Получатель) Экспорт
	
	Если ПравоДоступа("Изменение",Метаданные.Справочники.ОсновныеСредства) Тогда
		
		Элем = ОС.ПолучитьОбъект();
		Элем.Подразделение = Получатель;
		Элем.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТикеты(Ссылка, Услуги, Товары, Тикет) Экспорт
	
	Док = Ссылка.ПолучитьОбъект();
	Для Каждого СтрокаТЧ Из Услуги Цикл
		СтрокаДока = Док.Услуги[СтрокаТЧ.НомерСтрокиРеал - 1];
		Если СтрокаТЧ.Пометка Тогда
			СтрокаДока.Ticket = Тикет;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаДока = Док.Товары[СтрокаТЧ.НомерСтрокиРеал - 1];
		Если СтрокаТЧ.Пометка Тогда
			СтрокаДока.Ticket = Тикет;
		КонецЕсли;
	КонецЦикла;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

Процедура ПроизвестиРасчетАмортизации(Документ, СписокОС) Экспорт
	Перем ДатаПринятияКУчету;
	Перем ДокументПринятияКУчету;
	
	//добавила Федотова Л, РГ-Софт, 05.03.10 ->
	ТекОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
	Набор = РегистрыСведений.РасчетАмортизацииОС.СоздатьНаборЗаписей();                                          
	//ЭтотПериод = НачалоМесяца(Документ.Дата);
	ДатаПроведения = Документ.Дата;
	Если НЕ ТипЗнч(Документ) = Тип("Структура") Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаПроведения", Документ.Метаданные())  Тогда
			ДатаПроведения = ?(Документ.ДатаПроведения = Дата(1,1,1),Документ.Дата,Документ.ДатаПроведения);
		КонецЕсли;	
	КонецЕсли; 
	ДатаПроведения = НачалоДня(ДатаПроведения);
	ЭтотПериод = НачалоМесяца(ДатаПроведения);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК ОС,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение,
	|	ЕСТЬNULL(НачислениеАмортизацииСрезПоследних.НачислятьБУ, ЛОЖЬ) КАК НачислятьБУ,
	|	ЕСТЬNULL(НачислениеАмортизацииСрезПоследних.НачислятьНУ, ЛОЖЬ) КАК НачислятьНУ,
	|	ЕСТЬNULL(НачислениеАмортизацииСрезПоследних.СпециальныйКоэффициент, 1) КАК СпециальныйКоэффициент,
	|	НачислениеАмортизацииСрезПоследних.СрокБУ КАК СрокБУ,
	|	НачислениеАмортизацииСрезПоследних.СтоимостьБУ КАК СтоимостьБУ,
	|	НачислениеАмортизацииСрезПоследних.СрокНУ КАК СрокНУ,
	|	ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.СуммаКВОстаток, 0) КАК СуммаКВ,
	|	ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.СтоимостьНУОстаток, 0) КАК СтоимостьНУ,
	|	ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.СтоимостьНУОстаток, 0) - ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.СуммаКВОстаток, 0) - ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.АмортизацияНУОстаток, 0) КАК ОстаточнаяСтоимостьНУ,
	|	НачислениеАмортизацииСрезПоследних.ДатаИзмененияБУ,
	|	НачислениеАмортизацииСрезПоследних.ДатаВводаНУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОсновныеСредства.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.ОсновныеСредства КАК ОсновныеСредства
	|	ГДЕ
	|		ОсновныеСредства.Ссылка В(&СписокОС)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	|		ПО ВложенныйЗапрос.Ссылка = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьАмортизацияОС.Остатки(&ДатаНУ, ОсновноеСредство В (&СписокОС)) КАК СтоимостьАмортизацияОСОстатки
	|		ПО ВложенныйЗапрос.Ссылка = СтоимостьАмортизацияОСОстатки.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведения.СрезПоследних(&Дата, ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияСрезПоследних
	|		ПО ВложенныйЗапрос.Ссылка = ПервоначальныеСведенияСрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизации.СрезПоследних(&Дата, ОсновноеСредство В (&СписокОС)) КАК НачислениеАмортизацииСрезПоследних
	|		ПО ВложенныйЗапрос.Ссылка = НачислениеАмортизацииСрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьАмортизацияОС.Обороты(&ДатаНУнач, &ДатаНУ, Период, ОсновноеСредство В (&СписокОС)) КАК СтоимостьАмортизацияОСОбороты
	|		ПО ВложенныйЗапрос.Ссылка = СтоимостьАмортизацияОСОбороты.ОсновноеСредство");
	
	//Если ТипЗнч(Документ) = Тип("ДокументСсылка.РазукрупнениеОС") Тогда

	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.СтоимостьНУОстаток, 0) КАК СтоимостьНУ", 	
	//         "ЕСТЬNULL(СтоимостьАмортизацияОСОстатки.СтоимостьНУОстаток - ЕСТЬNULL(СтоимостьАмортизацияОСОбороты.АмортизацияНУПриход, 0), 0) КАК СтоимостьНУ");
	//КонецЕсли;	
	
	//Запрос.УстановитьПараметр("Дата", Новый Граница(Документ.Дата+1));
	
	//Добавила условие Федотова Л., РГ-Софт, 22.10.12, вопрос №SLI-0002928 ->
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ИзменениеПараметровНачисленияАмортизацииОС") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ИзменениеПараметровНачисленияАмортизацииОС") Тогда
		Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(ДатаПроведения+1)));
	Иначе	
		Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(ДатаПроведения)));
	КонецЕсли; 
	
	Если ДатаПроведения < Дата('20020101') Тогда
		Запрос.УстановитьПараметр("ДатаНУ", Новый Граница(Дата('20020101')+1));
	Иначе
		Запрос.УстановитьПараметр("ДатаНУ", Новый Граница(КонецДня(ДатаПроведения)));
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНУнач", Новый Граница(НачалоДня(ДатаПроведения)));
	Запрос.УстановитьПараметр("СписокОС", СписокОС);
	//Запрос.УстановитьПараметр("Организация", Документ.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РазукрупнениеОС") Тогда
		ЭтоПервыйДокумент = Ложь;
		Если СписокОС.Количество() > 1 Тогда
			ЭтоПервыйДокумент = Истина;
		ИначеЕсли СписокОС.Количество() = 1 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПервоначальныеСведения.Регистратор
			|ИЗ
			|	РегистрСведений.ПервоначальныеСведения КАК ПервоначальныеСведения
			|ГДЕ
			|	ПервоначальныеСведения.ОсновноеСредство В(&СписокОС)";
			
			Запрос.УстановитьПараметр("СписокОС", СписокОС);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.РазукрупнениеОС") Тогда
					ЭтоПервыйДокумент = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.МодернизацияОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ИзменениеПараметровНачисленияАмортизацииОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ПринятиеКУчетуОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ВводНачальныхОстатковОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ИзменениеСпециальногоКоэффициентаОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаЗаписейРегистров") ИЛИ
	(ТипЗнч(Документ) = Тип("ДокументСсылка.РазукрупнениеОС") И ЭтоПервыйДокумент) ИЛИ
	(ТипЗнч(Документ) = Тип("ДокументСсылка.КомплектацияОС") И СписокОС.Количество() = 1) ИЛИ
	ТипЗнч(Документ) = Тип("Структура") Тогда
		
		Пока Выборка.Следующий() Цикл
            //добавила Федотова Л, РГ-Софт, 05.03.10 ->
			УправлениеВнеоборотнымиАктивами.ПолучитьДокументБухСостоянияОС(Выборка.ОС, ТекОрганизация, Перечисления.СостоянияОС.ПринятоКУчету, ДокументПринятияКУчету, ДатаПринятияКУчету);
            //<-
		 	Набор.Отбор.ОсновноеСредство.Значение = Выборка.ОС;
			Набор.Отбор.ОсновноеСредство.Использование = Истина;
			Набор.Прочитать();
			ИсходнаяТаблица = Набор.Выгрузить();
			НоваяТаблица = ИсходнаяТаблица.Скопировать();
			НоваяТаблица.Очистить();
			//КоличествоМесяцевУчтенное = 0;
			Для Каждого СтрокаТЧ Из ИсходнаяТаблица Цикл
				Если СтрокаТЧ.ПериодАмортизации <= ЭтотПериод или (СтрокаТЧ.ПериодАмортизации = ЭтотПериод и ЭтотПериод > Дата('20070101')) //все до нашего документа оставляем как есть
					ИЛИ СтрокаТЧ.РучнаяКорректировка Тогда  //а также не меняем строки ручной корректировки					
					СтрокаТЗ = НоваяТаблица.Добавить();
					//КоличествоМесяцевУчтенное = КоличествоМесяцевУчтенное + 1;
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
			ПериодАмортизации = ЭтотПериод;
			Если Выборка.НачислятьБУ Тогда
				//расчет БУ
				КоличествоМесяцев = Выборка.СрокБУ; 
				Если КоличествоМесяцев <> 0 Тогда
					СуммаБУ = Выборка.СтоимостьБУ/КоличествоМесяцев;
				Иначе
					СуммаБУ = 0;
				КонецЕсли;
				КоличествоМесяцевОставшееся = КоличествоМесяцев - УправлениеВнеоборотнымиАктивами.РазностьДат(Выборка.ДатаИзмененияБУ, ЭтотПериод, "Месяц");
				Если ДатаПринятияКУчету < Дата('20070101') и НачалоМесяца(ДатаПринятияКУчету) = ДатаПринятияКУчету 
					И НЕ(ТипЗнч(Документ) = Тип("ДокументСсылка.ВводНачальныхОстатковОС") ИЛИ
								ТипЗнч(Документ) = Тип("ДокументСсылка.ПринятиеКУчетуОС") ИЛИ
								ТипЗнч(Документ) = Тип("ДокументОбъект.ВводНачальныхОстатковОС") ИЛИ
								ТипЗнч(Документ) = Тип("ДокументОбъект.ПринятиеКУчетуОС")) Тогда
					КоличествоМесяцевОставшееся = КоличествоМесяцевОставшееся - 1;
				КонецЕсли;
				Если КоличествоМесяцевОставшееся > 0 Тогда
					н = 0;
					//Для к = 1 По КоличествоМесяцевОставшееся-н Цикл
					Для к = 1 По КоличествоМесяцевОставшееся Цикл
						//Если Документ.Дата < Дата('20060101') и НачалоМесяца(Документ.Дата) = Документ.Дата Тогда  //изменила Федотова Л, РГ-Софт, 05.03.10
						Если ДатаПринятияКУчету < Дата('20070101') и НачалоМесяца(ДатаПринятияКУчету) = ДатаПринятияКУчету Тогда
							ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к-1);
							Если (ТипЗнч(Документ) = Тип("ДокументСсылка.ВводНачальныхОстатковОС") ИЛИ
								ТипЗнч(Документ) = Тип("ДокументСсылка.ПринятиеКУчетуОС") ИЛИ
								ТипЗнч(Документ) = Тип("ДокументОбъект.ВводНачальныхОстатковОС") ИЛИ
								ТипЗнч(Документ) = Тип("ДокументОбъект.ПринятиеКУчетуОС")) И ПериодАмортизации = ДатаПроведения Тогда
								СтрокаТЗ = НоваяТаблица.Добавить();
								СтрокаТЗ.ПериодАмортизации = ПериодАмортизации;
								СтрокаТЗ.Подразделение = Выборка.Местонахождение;
								СтрокаТЗ.ОсновноеСредство = Выборка.ОС;
								СтрокаТЗ.СуммаБУ = СуммаБУ;	
								н = 1;
							Иначе
								ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к-н);
							КонецЕсли; 
						Иначе
							ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к);
						КонецЕсли;
						//Если ПериодАмортизации > Документ.Дата Тогда 
						Если ПериодАмортизации > ДатаПроведения Тогда 
							СтрокаТЗ = НоваяТаблица.Добавить();
							СтрокаТЗ.ПериодАмортизации = ПериодАмортизации;
							СтрокаТЗ.Подразделение = Выборка.Местонахождение;
							СтрокаТЗ.ОсновноеСредство = Выборка.ОС;
							СтрокаТЗ.СуммаБУ = СуммаБУ;	                        
						КонецЕсли;
					КонецЦикла;
					//в последней строке поправка на округления; если разница > 10, то поправка - в новой строке
					Если КоличествоМесяцев > 0 Тогда
						Разница = Выборка.СтоимостьБУ - Окр(СуммаБУ,2)*КоличествоМесяцев;
						Если Разница > 10 Тогда
						    СтрокаТЗ.СуммаБУ = СтрокаТЗ.СуммаБУ + Разница;
							//Если Документ.Дата < Дата('20060101') и НачалоМесяца(Документ.Дата) = Документ.Дата Тогда //изменила Федотова Л, РГ-Софт, 05.03.10
							Если ДатаПринятияКУчету < Дата('20070101') и НачалоМесяца(ДатаПринятияКУчету) = ДатаПринятияКУчету Тогда
								ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к-1);
							Иначе
								ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к);
							КонецЕсли;
							//Если ПериодАмортизации > Документ.Дата Тогда 
							Если ПериодАмортизации > ДатаПроведения Тогда 
								СтрокаТЗ = НоваяТаблица.Добавить();
								СтрокаТЗ.ПериодАмортизации = ПериодАмортизации;
								СтрокаТЗ.Подразделение = Выборка.Местонахождение;
								СтрокаТЗ.ОсновноеСредство = Выборка.ОС;
								СтрокаТЗ.СуммаБУ = Разница;				
							КонецЕсли; 
						Иначе
						    СтрокаТЗ.СуммаБУ = СтрокаТЗ.СуммаБУ + Разница;
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
			
			Если Выборка.НачислятьНУ Тогда
				//расчет НУ
				
				КоличествоМесяцев = Выборка.СрокНУ/Выборка.СпециальныйКоэффициент;
				Если КоличествоМесяцев <> 0 Тогда
					Если ТипЗнч(Документ) = Тип("ДокументСсылка.КомплектацияОС") И СписокОС.Количество() = 1  Тогда
						СуммаНУ = Окр(Выборка.ОстаточнаяСтоимостьНУ/КоличествоМесяцев,2);
					Иначе
						//СуммаНУ = Окр((Выборка.СтоимостьНУ - Выборка.СтоимостьНУ - Выборка.СуммаКВ)/КоличествоМесяцев,2);
						СуммаНУ = Окр((Выборка.СтоимостьНУ - Выборка.СуммаКВ)/КоличествоМесяцев,2);
					КонецЕсли;
				Иначе
					СуммаНУ = 0;
				КонецЕсли;
				
				Запрос2 = Новый Запрос;
				Запрос2.Текст = "ВЫБРАТЬ
				|	РасчетАмортизацииОС.СуммаНУ
				|ИЗ
				|	РегистрСведений.РасчетАмортизацииОС КАК РасчетАмортизацииОС
				|ГДЕ
				|	РасчетАмортизацииОС.ПериодАмортизации <= &ЭтотПериод
				|	И РасчетАмортизацииОС.ОсновноеСредство = &ОсновноеСредство";
				
				Запрос2.УстановитьПараметр("ЭтотПериод", ЭтотПериод);
				Запрос2.УстановитьПараметр("ОсновноеСредство", Выборка.ОС);
				
				Результат2 = Запрос2.Выполнить();
				Выборка2 = Результат2.Выбрать();
				
				АмортизацияДоИзменения = 0;
				Пока Выборка2.Следующий() Цикл
					АмортизацияДоИзменения = АмортизацияДоИзменения + Выборка2.СуммаНУ;
				КонецЦикла;
				                                         
				//Если ТипЗнч(Документ) = Тип("ДокументСсылка.РазукрупнениеОС") И СписокОС.Количество() > 1  Тогда
				//	СтрокаОССписания = Документ.ОС[0];              
				//	СтрокаНовОС = Документ.НовыеОС.Найти(Выборка.ОС,"ОсновноеСредство");
				//	ВсегоДолей = Документ.НовыеОС.Итог("Доля");
				//	АмортизацияДоИзменения = Окр(СтрокаНовОС.Доля/ВсегоДолей * (СтрокаОССписания.АмортизацияНУ + СтрокаОССписания.АмортизацияЗаМесяцНУ),2);
				//КонецЕсли;
				//
				//Если ТипЗнч(Документ) = Тип("ДокументСсылка.КомплетацияОС") И СписокОС.Количество() = 1  Тогда
				//	СтрокаНовОС = Документ.НовоеОС[0];              
				//	АмортизацияДоИзменения = СтрокаНовОС.АмортизацияНУ;
				//КонецЕсли;
				
				ОсталосьСписать = Выборка.ОстаточнаяСтоимостьНУ;
				
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеОС") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПеремещениеОС") Тогда 
					ОсталосьСписать = ?(ОсталосьСписать - СуммаНУ > 0,ОсталосьСписать - СуммаНУ,0);
				КонецЕсли;
				
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.ИзменениеПараметровНачисленияАмортизацииОС") Тогда
					СтрокаДокумента = Документ.ОС.Найти(Выборка.ОС, "ОсновноеСредство");
					АмортизацияДоИзменения = АмортизацияДоИзменения + СтрокаДокумента.ДобавленнаяАморитзацияНУ;
					ОсталосьСписать = Выборка.СтоимостьНУ - Выборка.СуммаКВ - АмортизацияДоИзменения;
				КонецЕсли;
				
				ПериодАмортизации = ЭтотПериод;
				Если ОсталосьСписать > 0 И СуммаНУ > 0 Тогда
					к = 1;
					Пока ОсталосьСписать > 10 Цикл 
						Если ДобавитьМесяц(ПериодАмортизации, 1) >= Дата('20020101') Тогда //только после 2002 года
							Если ДатаПринятияКУчету < Дата('20070101') И НачалоМесяца(ДатаПринятияКУчету) = ДатаПринятияКУчету Тогда
								ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к-1);
								Если (ТипЗнч(Документ) = Тип("ДокументСсылка.ВводНачальныхОстатковОС") ИЛИ
									ТипЗнч(Документ) = Тип("ДокументСсылка.ПринятиеКУчетуОС") ИЛИ
									ТипЗнч(Документ) = Тип("ДокументОбъект.ВводНачальныхОстатковОС") ИЛИ
									ТипЗнч(Документ) = Тип("ДокументОбъект.ПринятиеКУчетуОС")
									)  И ПериодАмортизации = ДатаПроведения Тогда
									СтрокаТЗ = НоваяТаблица.Добавить();
									СтрокаТЗ.ПериодАмортизации = ПериодАмортизации;
									СтрокаТЗ.Подразделение = Выборка.Местонахождение;
									СтрокаТЗ.ОсновноеСредство = Выборка.ОС;
									СтрокаТЗ.СуммаНУ = СуммаНУ;	
									ОсталосьСписать = ОсталосьСписать - СуммаНУ;
								КонецЕсли;
								ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к);
							Иначе
								ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к);
							КонецЕсли;
							//Если ДатаПроведения >= Дата('20020101') И ПериодАмортизации > ДатаПроведения Тогда //только после 2002 года
							//Если ПериодАмортизации >= Дата('20020101') И ПериодАмортизации > ДатаПроведения Тогда //только после 2002 года
							Если ПериодАмортизации > ДатаПроведения Тогда 
								СтрокаТЗ = НоваяТаблица.Добавить();
								СтрокаТЗ.ПериодАмортизации = ПериодАмортизации;
								СтрокаТЗ.Подразделение = Выборка.Местонахождение;
								СтрокаТЗ.ОсновноеСредство = Выборка.ОС;
								СтрокаТЗ.СуммаНУ = СуммаНУ;				
							КонецЕсли;
							//Если ПериодАмортизации >= Дата('20020101') Тогда
								ОсталосьСписать = ОсталосьСписать - СуммаНУ;
							//КонецЕсли;
						Иначе
							ПериодАмортизации = ДобавитьМесяц(ЭтотПериод, к);
						КонецЕсли;
						к = к + 1;
					КонецЦикла;
					//в последней строке поправка на округления; если разница > 10, то поправка - в новой строке
					Если НоваяТаблица.Количество() > 0 Тогда
						СтрокаТЗ.СуммаНУ = СтрокаТЗ.СуммаНУ + ОсталосьСписать;
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			НоваяТаблица.Свернуть("ПериодАмортизации, Подразделение, ОсновноеСредство, РучнаяКорректировка","СуммаБУ, СуммаНУ");
			Для каждого Строка Из НоваяТаблица Цикл
				Если Строка.Подразделение.Пустая() Тогда
					Строка.Подразделение = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию("Dummy Location", Истина);
				КонецЕсли; 
			КонецЦикла; 
			Набор.Загрузить(НоваяТаблица);
			Набор.Записать();
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СписаниеОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ПередачаОС") ИЛИ
	ТипЗнч(Документ) = Тип("ДокументСсылка.ПодготовкаКПередачеОС") ИЛИ
	(ТипЗнч(Документ) = Тип("ДокументСсылка.РазукрупнениеОС") И НЕ ЭтоПервыйДокумент) ИЛИ
	(ТипЗнч(Документ) = Тип("ДокументСсылка.КомплектацияОС") И СписокОС.Количество() > 1) Тогда
		
		//а ничего делать не надо, просто не заполняем дальше таблицу
		
		//а по-моему, таблицу надо очистить, начиная с месяца, следующего за месяцем списания
		Пока Выборка.Следующий() Цикл

		 	Набор.Отбор.ОсновноеСредство.Значение = Выборка.ОС;
			Набор.Отбор.ОсновноеСредство.Использование = Истина;
			Набор.Прочитать();
			ИсходнаяТаблица = Набор.Выгрузить();
			НоваяТаблица = ИсходнаяТаблица.Скопировать();
			НоваяТаблица.Очистить();
			КоличествоМесяцевУчтенное = 0;
			Для Каждого СтрокаТЧ Из ИсходнаяТаблица Цикл
				Если СтрокаТЧ.ПериодАмортизации <= ЭтотПериод Тогда  //все до нашего документа плюс начало месяца от даты документа оставляем как есть
					СтрокаТЗ = НоваяТаблица.Добавить();
					КоличествоМесяцевУчтенное = КоличествоМесяцевУчтенное + 1;
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
			Набор.Загрузить(НоваяТаблица);
			Набор.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПодразделениеНачисленияАмортизации(ИсходнаяЛокация) Экспорт
	
	Локация = ИсходнаяЛокация;
	
	Пока Истина Цикл
		Если Локация.ЭтоГруппа И Локация.НачислениеАмортизацииОС Тогда
			Возврат Локация;
		ИначеЕсли Не Локация.Родитель = Неопределено И НЕ Локация.Родитель.Пустая() Тогда
			Локация = Локация.Родитель;
		Иначе
			Сообщить("Не задано подразделение, по которому начисляется амортизация для локации "+ИсходнаяЛокация);		
			Возврат ИсходнаяЛокация;
		КонецЕсли;
	КонецЦикла;

КонецФункции
